Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/tm/cuspy-level1.tmx
Source language: en_gb
Languages: fr_fr

source: The function :func:`write_pest_files` is used to write the files necessary to run programs of the PEST(++) suite.
fr_fr: La fonction :func:`write_pest_files` sert à écrire les fichiers nécessaires pour tourner des programmes de PEST(++).

source: The function in this module is used to launch the PEST++ executable.
fr_fr: La fonction dans cette module sert à lancer l'exécutable de PEST++.

source: The functions in this module are used to manage reading and writing of input and output files.
fr_fr: Les fonctions de ce module servent à lire et écrire des fichiers d'entrée et sortie.

source: The functions in this module carry the different type of analyses implemented in the package.
fr_fr: Les fonctions dans ce module réalisent les différents types d'analyse implémentées dans le paquet.

source: The implementation of the IES method uses the GLM algorithm (called with `pestpp-glm`), which can be configured using the `pst_file0` and `control_data` arguments.
fr_fr: L'implémentation de la méthode IES utilise l'algorithme GLM (appelé avec `pestpp-glm`), qui peut être configuré en utilisant les arguments `pst_file0` et `control_data`.

source: The included scripts are:
fr_fr: Les scripts inclus sont:

source: The index :math:`S_i` theoretically varies between 0 (unsensitive) and 1 (maximum sensitivity).
fr_fr: L'index :math:`S_i` varie théoriquement entre 0 (non sensible) et 1 (sensitivité maximale).

source: The index :math:`S_{T_i}` is equal to :math:`S_i` if there are no interactions between parameter :math:`X_i` and other parameters, and greater than :math:`S_i` if there are interactions with other parameters.
fr_fr: L'index :math:`S_{T_i}` est égal à :math:`S_i` si'l n'y a pas d'interactions entre le paramètre :math:`X_i` et d'autres paramètres, et plus grand que :math:`S_i` s'il y a des interactions avec d'autres paramètres.

source: The installation process is as above:
fr_fr: Le procès d'installation est comme ci-dessus :

source: The keys indicate the variables used to group data into percentiles; the values are lists of variables names for which partial averages will be calculated for each of the percentile groups of the key variable.
fr_fr: Les clés indiquent les variables utilisées pour grouper les données par percentiles; les valeurs sont listes des noms des variables pour lesquelles des moyennes partielles seront calculées pour chaque groupe de la variable clé.

source: The lake data in the :file:`lake.txt` file corresponds to the Lake Allos (lake code = ALL04).
fr_fr: Les données de lac dans le fichier :file:`lake.txt` correspondent au lac d'Allos (code de lac = ALL04).

source: The main requirements are that the model can be run through the command line and that it communicates with the user through text files.
fr_fr: Les principaux besoins sont qu'il soit possible de faire tourner le modèle depuis la ligne de commandes et que la communication avec l'utilisateur soit par le moyen de fichiers texte.

source: The meteorological data (:file:`meteo.txt`) is synthetic data based on meteorological data.
fr_fr: Les données météorologiques (:file:`meteo.txt`) sont des données synthetiques créées depuis des données météorologiques.

source: The method draws several random samples of the prior parameter distributions and adjusts their values iteratively, so that each set of parameter values can be considered to be calibrated.
fr_fr: La méthode extrait plusieurs échantillons aléatoires depuis les distributions des paramètres a priori et ajuste leurs valeurs itérativement, de façon que chaque ensemble de valeurs des paramètres peut être considéré comme calibré.

source: The method of Sobol is a Monte Carlo-based method of decomposition of the variance.
fr_fr: La méthode de Sobol est une méthode de Monte Carlo de décomposition de la variance.

source: The model output also depends on the implicit and explicit assumptions made in its specification and how the behaviour of the system has been implemented.
fr_fr: Le retour du modèle dépends aussi des suppositions implicites ou explicites faites dans sa spécification et de comment on a implémenté le comportement du système.

source: The model predicts an average increase of 1.1 ºC in water temperature with a 1.5 ºC increase in water temperature.
fr_fr: Le modèle prédits une augmentation moyenne de la température de l'eau de 1,1ºC avec une augmentation de 1.5ºC de la température de l'air.

source: The modelling process
fr_fr: Le procès de modélisation

source: The modelling process can be divided in 10 stages (Jakeman et al., 2006):
fr_fr: Le procès de modélisation peut être sous-divisé en 10 étapes (Jakeman et al., 2006) :

source: The name of the output csv file can be modified using the `pestpp_opts` argument:
fr_fr: Le nom du fichier de sortie csv peut être modifié en utilisant l'argument `pestpp_opts` :

source: The names of the output files follow the pattern "mc_uncert_<v>.txt", where `v` is the name of the output variable as used in :file:`sweep_out.csv`.
fr_fr: Les noms des fichiers de sortie suivent le modèle "mc_uncert_<v>.txt", où `v` est le nom de la variable de sortie telle quelle est utilisée dans :file:`sweep_out.csv`.

source: The number of ensemble members should be greater than the dimensionality of the solution space.
fr_fr: Le nombre de membres de l'ensemble devrait être supérieur à la dimensionnalité de l'espace de solution.

source: The number of simulations (``n_reals``) used in Monte Carlo experiences is usually of the order of thousands and greater.
fr_fr: Le nombre de simulations (``n_reals``) utilisé dans des expériences de Monte Carlo est d'habitude de l'ordre de milliers ou plus.

source: The objective function results during all iterations can be found in the files :file:`case.phi.actual.csv` (objective function calculated from differences between forecasts and observations), :file:`case.phi.meas.csv` (objective function calculated from differences between forecasts and noisy observations), :file:`case.phi.group.csv` (objective function calculated by parameter and observation groups) and :file:`case.phi.regul.csv` (regularization objective functions).
fr_fr: Les résultats de la fonction d'objectifs pour toutes les itérations se trouve dans les fichiers :file:`case.phi.actual.csv` (fonction d'objectifs calculée par rapport aux différences entre prédictions et observations), :file:`case.phi.meas.csv` (fonction d'objectifs calculée par rapport aux différences entre prédictions et observations avec du bruit), :file:`case.phi.group.csv` (fonction d'objectifs calculée par paramètre et groupe d'observation) et :file:`case.phi.regul.csv` (fonction d'objectifs avec régularisation).

source: The objective is that parameter and predictive uncertainty should be reduced after the calibration process.
fr_fr: L'objectif est de réussir à réduire l'incertitude prédictive et des paramètres après le procès de calibration.

source: The objective is to obtain the distribution of parameter values, based on the analysis of which parameter values produce simulations that are consistent with observations of the system behaviour.
fr_fr: L'objectif est d'obtenir la distribution des valeurs des paramètres, en base à l'analyse de quelles valeurs des paramètres donnent des simulations cohérentes avec les observations du comportement du système.

source: The objective is to test whether the model performs equally well under a different set of circumstances.
fr_fr: L'objectif est de tester si le comportement du modèle est aussi bon sous un groupe différent de circonstances.

source: The objective of the exercise will be to estimate water temperature and its uncertainty on the 1st and 15th of each month in 2015.
fr_fr: L'objectif de l'exercice est d'estimer la température de l'eau et son incertitude les jours 1er et 15e de chaque mois en 2015.

source: The objective of the method is to assess the proportion of the output variance that is due to each parameter.
fr_fr: L'objectif de la méthode est d'évaluer la proportion de la variance des résultats qui est due à chaque paramètre.

source: The observation weights can be modified with the argument ``obs_weights``.
fr_fr: Les poids des observations peuvent être modifiées avec l'argument ``obs_weights``.

source: The observations
fr_fr: Les observations

source: The observations in :file:`obs.txt` receive a positive weight (1 by default) and if there is missing data (coded as NA, NaN or nan), the corresponding rows will be ignored.
fr_fr: Les observations dans :file:`obs.txt` prennent un poids positif (1 par défaut) et s'il y a des données manquantes (codées comme NA, NaN ou nan), les files correspondantes seront ignorées.

source: The observations in the files :file:`obs.txt` and :file:`pred.txt` are fictitious and their only aim is to verify the package is working correctly and to help learn its usage.
fr_fr: Les observations dans les fichiers :file:`obs.txt` et :file:`pred.txt` sont fitives et leur seul but est de vérifier le correct fonctionnement du paquet et d'aider dans l'apprentissage de son utilisation.

source: The optimized parameter value sets can be found in the file :file:`case.N.par.csv`, where "case" is the name of the pest file `pst_file1` and "N" is the number of the latest iteration.
fr_fr: Les jeux de valeurs des paramètres optimisées se trouvent dans le fichier :file:`cas.N.par.csv`, où "cas" est le nom du fichier PEST `pst_file1` et "N" est le numéro de la dernière itération.

source: The output html files are saved in the folder :file:`pathtorepertorycuspy/sphinx-doc/build/html`.
fr_fr: Les fichiers html de sortie sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/build/html`.

source: The output html files are saved in the folder :file:`pathtorepertorycuspy/sphinx-doc/build_fr/html`.
fr_fr: Les fichiers html de sortie sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/build_fr/html`.

source: The output latex and pdf files are saved in the folder :file:`pathtorepertorycuspy/sphinx-doc/build/latex`.
fr_fr: Les fichiers latex et pdf de sortie sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/build/latex`.

source: The output latex and pdf files are saved in the folder :file:`pathtorepertorycuspy/sphinx-doc/build_fr/latex`.
fr_fr: Les fichiers latex et pdf de sortie sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/build_fr/latex`.

source: The output of a model can be of several types, defined in the following table:
fr_fr: Le retour d'un modèle peut être de plusieurs types, définis dans la table suivante :

source: The output of the :func:`ies` function can be found in a series of csv files.
fr_fr: Le retour de la fonction :func:`ies` peut être trouvé dans une série de fichiers csv.

source: The output of the PEST++ command is shown on screen.
fr_fr: Le retour de l'instruction de PEST++ es montrée sur l'écran.

source: The package :mod:`cuspy` (Calibration, Uncertainty and Sensitivity analysis in PYthon) is a package in Python 3 that provides tools for parameter estimation, and sensitivity and uncertainty analyses of models.
fr_fr: Le paquet :mod:`cuspy` (Calibration, Incertitude et analyse de Sensitivité en PYthon) est un paquet en Python 3 qui proportionne des instruments pour l'estimation de paramètres, et pour les analyses de sensitivité et d'incertitude des modèles.

source: The package :mod:`pyemu` also depends on :mod:`matplotlib` for plotting.
fr_fr: Le paquet :mod:`pyemu` dépend aussi de :mod:`matplotlib` pour tracer des graphiques.

source: The package :mod:`pyemu` offers a Python interface to use and configure PEST++ tools and to access and process their results.
fr_fr: Le paquet :mod:`pyemu` présente une interface Python pour utiliser et configurer les outils de PEST++ et pour accéder et traiter leurs résultats.

source: The package :mod:`sphinx` works by default with reStructuredText documents.
fr_fr: Le paquet :mod:`sphinx` travaille par défaut avec documents de type reStructuredText.

source: The paramater :math:`\gamma` is much less influential.
fr_fr: Le paramètre :math:`\gamma` est beaucoup moins influent.

source: The parameter data file (``par_data_file``)
fr_fr: Le fichier de données des paramètres (``par_data_file``)

source: The parameter file is a text file where the values of the parameters used by the model are written.
fr_fr: Le fichier de paramètres est un fichier texte où sont écrites les valeurs des paramètres utilisés par le modèle.

source: The parameters of the model should not vary with time.
fr_fr: Les paramètres du modèle ne devraient varier pas dans le temps.

source: The parameters with highest identifiability in the study case are :math:`\gamma` and :math:`\beta`, which determine the slope and location of the curve around its inflexion point.
fr_fr: Les paramètres avec une identifiabilité plus élevé dans le cas d'étude sont :math:`\gamma` et :math:`\beta`, qui déterminent la pente et position de la courbe autour de son point d'inflexion.

source: The pest instance returned by the function can be used to access the results of the calibration.
fr_fr: L'instance PEST retournée par la fonction peut être utilisées pour accéder aux résultats de la calibration.

source: The po files contain pairs of segments of text in the source (msgid) and target language (msgstr).
fr_fr: Les fichiers po contiennent paires de segments de texte dans les langues source (msgid) et cible (msgstr).

source: The possible values are "none", "log", "fixed" or "tied".
fr_fr: Les valeurs possibles sont "none", "log", "fixed" or "tied".

source: The possible values are: "relative" and "factor".
fr_fr: Les valeurs possibles sont : "relative" et "factor".

source: The presence of structural errors and measurement noise/error results in parameter uncertainty that may affect parameter identifiability.
fr_fr: La présence d'erreurs structurales et bruit/erreur dans les mesures cause une incertitude des paramètres qui peut affecter l'identifiabilité des paramètres.

source: The previous process of fixing the value of some parameters is an example of (manual) regularisation, a process by which the complexity of a model is reduced so that the remaining parameters can be estimated uniquely (i.e., with low uncertainty).
fr_fr: Le procès susdit de fixer la valeur de certains paramètres est un exemple de régularisation (manuelle), une opération par laquelle on réduit la complexité d'un modèle de façon que le reste de paramètres puisse être estimé de façon univoque (i.e., avec une basse incertitude).

source: The rational is that the few singular values kept are enough to characterise most of the information, while the discarded singular values represent mostly noise.
fr_fr: Le raisonnement est que le peu de valeurs singulières retenues sont suffisantes pour caractériser la plus grande partie de l'information, alors que les valeurs singulières rejetées représentent majoritairement du bruit.

source: The reduction in the uncertainty of the parameter values results in a decrease in the uncertainty of the simulations.
fr_fr: La réduction de l'incertitude des valeurs des paramètres produit une diminution de l'incertitude des simulations.

source: The relationship between air and water temperatures can be described by a non-linear equation.
fr_fr: La relation entre les températures de l'air et de l'eau peut être décrite avec une équation non linéaire.

source: The residuals are small and are not attributable to any nonrandom causal mechanism.
fr_fr: Les résidus sont petits et ne sont pas attribuables à aucun mécanisme causal non aléatoire.

source: The result of a lack of identifiability is the absence of a unique optimum combination of parameter values (the model performs with similar good performance for different combinations of parameter values) and in high error variances and covariances of parameters.
fr_fr: Le résultat d'un manque d'identifiabilité est l'absence d'une combinaison optimale des valeurs des paramètres unique (le modèle donne des simulations similairement bonnes avec différentes combinaisons des valeurs des paramètres) et l'existence de grandes variances de l'erreur et de la covariance des paramètres.

source: The resulting po files are stored in the folder :file:`source/locale/fr/LC_MESSAGES`.
fr_fr: Les fichiers po créés sont stockés dans le dossier :file:`source/locale/fr/LC_MESSAGES`.

source: The resulting pot files are saved in the folder :file:`build/gettext`.
fr_fr: Les fichiers pot créés sont stockés dans le dossier :file:`build/gettext`.

source: The results of the sensitivity analysis depend on the range of parameter values explored in the analysis, i.e., on the uncertainty of individual parameters.
fr_fr: Les résultats de l'analyse de sensitivité dépend du rang de valeurs des paramètres exploré pendant l'analyse, c'est-à-dire, de l'incertitude des paramètres individuels.

source: The scripts
fr_fr: Les scripts

source: The selected method needs to take into account the modelling objective and available data.
fr_fr: La méthode choisie doit prendre en considération l'objectif de la modélisation et les données disponibles.

source: The sets of parameter values drawn from the specified distribution are saved in the `csv_in` file (:file:`sweep_in.csv` by default).
fr_fr: Les jeux de valeurs des paramètres extraits de la distribution spécifiée sont sauvegardés dans le fichier `csv_in` (:file:`sweep_in.csv` par défaut).

source: The simulated values for the different parameter sets provide the prior uncertainty of the temperature estimations based on prior knowledge.
fr_fr: Les valeurs simulées pour les différents jeux de paramètres proportionnent l'incertitude a priori des estimations de la température en base aux connaissances antérieurement existantes.

source: The simulation results are also saved to a csv file, named :file:`sweep_out.csv` by default.
fr_fr: Les résultats de simulation sont sauvegardés aussi dans un fichier csv, qui s'appelle :file:`sweep_out.csv` par défaut.

source: The simulation results for each parameter set can be found in the file :file:`case.N.obs.csv`.
fr_fr: Les résultats de simulation pour chaque jeu de paramètres se trouve dans le fichier :file:`case.N.obs.csv`.

source: The source documentation files are converted to latex and then to pdf.
fr_fr: Les fichiers source de la documentation sont convertis à latex et après à pdf.

source: The source files for the project user manual are stored in the folder :file:`pathtorepertorycuspy/sphinx-doc/source`.
fr_fr: Les fichiers source du manuel d'utilisation du projet sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/source`.

source: The sum of all :math:`S_i` is equal to 1 for additive models (the effect of the parameters is independent), and it is less than 1 for nonadditive models (there are interactions between the parameters).
fr_fr: La somme de tous les :math:`S_i` est égale à 1 pour des modèles additifs (l'effet de chaque paramètre est indépendant), et elle est moins de 1 pour des modèles non-additifs (il y a des interactions entre les paramètres).

source: The sum of all :math:`S_{T_i}` is usually greater than 1; it is 1 only if the model is perfectly additive (no interactions between parameters).
fr_fr: La somme de tous les :math:`S_{T_i}` est habituellement supérieure à 1 ; c'est 1 seulement si le modèle est parfaitement additif (pas d'interactions entre paramètres).

source: The total effect index :math:`S_{T_i}` measures the contribution to the variance of the model output made by a parameter including interactions with other parameters.
fr_fr: L'index des effets totaux :math:`S_{T_i}` mesure la contribution à la variance des sorties du modèle d'un paramètre en incluant les interactions avec d'autres paramètres.

source: The translation instructions are based on https://sphinx-doc.org/en/master/usage/advanced/intl.html.
fr_fr: Les instructions de traduction sont basées sur https://sphinx-doc.org/en/master/usage/advanced/intl.html.

source: The translation of the documentation files is based on the extraction of the translatable text into pot (portable object template) files and the creation of translated text in po (portable object) files.
fr_fr: La traduction des fichiers de documentation est basé sur l'extraction du texte traduisible en fichiers pot (portable object template) et la création de texte traduit en fichiers po (portable object).

source: The uncertainty analysis deals with the confidence we can place on such forecasts and which are the ranges within which a predicted quantity may vary.
fr_fr: L'analyse d'incertitudes s'occupe de la crédibilité qu'on peut attribuer à ces prévisions et des rangs dans lesquels une quantité prédite peut varier.

source: The uncertainty file
fr_fr: Le fichier d'incertitude

source: The uncertainty of model simulations has mainly three sources:
fr_fr: L'incertitude des simulations d'un modèle a trois causes principales :

source: The user manual has been generated using :mod:`sphinx` from files using `reStructuredText <http://www.sphinx-doc.org/en/master/usage/restructuredtext/index.html>`_ markup language.
fr_fr: Le manuel d'utilisation a été généré avec :mod:`sphinx` depuis fichiers en format markup `reStructuredText <http://www.sphinx-doc.org/en/master/usage/restructuredtext/index.html>`_ .

source: The values on the following table are based on the results obtained by Mohseni et al.
fr_fr: Les valeurs de la table suivante sont dérivées depuis les résultats obtenus par Mohseni et al.

source: The variance of residuals and the covariance of parameters are low, indicating that the model parameters have been well identified.
fr_fr: La variance des résidus et la covariance des paramètres sont petites, ce qui indique que les paramètres du modèle ont été bien identifiés.

source: The variance of the model output is decomposed into different components, each one attributable to one parameter (or combination of parameters).
fr_fr: La variance du retour du modèle est décomposé en différentes composantes, chaque une attribuable à un paramètre (ou combinaison de paramètres).

source: The width of the interval can be modified with the PEST++ control variable ``par_sigma_range``.
fr_fr: La largeur de l'intervalle peut être modifiée avec la variable de contrôle de PEST++ ``par_sigma_range``.

source: The worth of data may be related to a cost-benefit analysis, where additional measurements have worth if the reduction in uncertainty overcomes the increased cost.
fr_fr: La valeur des données peut être relationnée à un analyse de coût-bénéfice, où les mesures additionnelles ont de la valeur si la réduction en incertitude supère l'incrément du coût.

source: Then you need to generate the po files for each target language.
fr_fr: Alors vous devez générer les fichiers po pour chaque langue cible.

source: Then, you only need to translate the modified segments.
fr_fr: Après, vous devrez traduire seulement les segments modifiés.

source: There are four possible options:
fr_fr: Il y a quatre options possibles :

source: There are the following options:
fr_fr: Il y a les options suivantes :

source: There are two options:
fr_fr: Il y a deux options :

source: There are two ways to assess data worth:
fr_fr: Il y a deux façons d'évaluer la valeur des données :

source: These effects may cause local minima, valleys and plateaus in the parameter response surface.
fr_fr: Ces effets peuvent causer des minimums locaux, des vallées et plateaux dans la surface de réponse des paramètres.

source: These methods can take into account all the complexity of the models.
fr_fr: Ces méthodes peuvent prendre en considération toute la complexité des modèles.

source: These must be prepared by the user.
fr_fr: Ces fichiers-ci doivent être préparés par l'utilisateur.
